tests-integration/cases/02_DECAY/01_tewn_2022-Incompressible-tewn_2022_ref33/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00375;

boundaryField
{
    face1
    {
        type            freestream;
        freestreamValue uniform 0.00375;
        value           uniform 0.00375;
    }
    face2
    {
        type            inletOutlet;
        inletValue      uniform 0.00375;
        value           uniform 0.00375;
    }
    face3
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    face4
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    face5
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    face6
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
    face7
    {
        type            kqRWallFunction;
        value           uniform 0.00375;
    }
}


// ************************************************************************* //
