tests-integration/cases/02_DECAY/01_tewn_2022-Incompressible-tewn_2022_ref33/constant/turbulenceProperties
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object turbulenceProperties;
}
simulationType RAS;
RAS {
    RASModel kOmegaSST;
    turbulence on;
    printCoeffs on;
}
